In [132]:
import pandas as pd

In [133]:
name = ['김유진','김정민','홍길동','박보람']
age = [25,31,36,13]
gender = [1,0,None,1]
grade = ['A','B','C','D']
result = [True,False,False,True]
survey = [3,4,1,3]

In [134]:
data = pd.DataFrame({'name':name,'age':age,'gender':gender,'grade':grade,'result':result,'survey':survey})

In [135]:
print(data)

  name  age  gender grade  result  survey
0  김유진   25     1.0     A    True       3
1  김정민   31     0.0     B   False       4
2  홍길동   36     NaN     C   False       1
3  박보람   13     1.0     D    True       3

In [136]:
data

  name  age  gender grade  result  survey
0  김유진   25     1.0     A    True       3
1  김정민   31     0.0     B   False       4
2  홍길동   36     NaN     C   False       1
3  박보람   13     1.0     D    True       3

In [137]:
data.transpose()

           0      1      2     3
name     김유진    김정민    홍길동   박보람
age       25     31     36    13
gender   1.0    0.0    NaN   1.0
grade      A      B      C     D
result  True  False  False  True
survey     3      4      1     3

In [138]:
data.T

           0      1      2     3
name     김유진    김정민    홍길동   박보람
age       25     31     36    13
gender   1.0    0.0    NaN   1.0
grade      A      B      C     D
result  True  False  False  True
survey     3      4      1     3

In [139]:
data_1 = pd.DataFrame(data = [name,age,gender,grade,result,survey],
                     columns = ['Customer1','Customer2','Customer3','Customer4'],
                    index = ['Name','Age','Gender(M:0,W:1)','Grade','Survey','Result'])

In [140]:
data

  name  age  gender grade  result  survey
0  김유진   25     1.0     A    True       3
1  김정민   31     0.0     B   False       4
2  홍길동   36     NaN     C   False       1
3  박보람   13     1.0     D    True       3

In [141]:
data_T = data_1.T
data_T

          Name Age Gender(M:0,W:1) Grade Survey Result
Customer1  김유진  25               1     A   True      3
Customer2  김정민  31               0     B  False      4
Customer3  홍길동  36            None     C  False      1
Customer4  박보람  13               1     D   True      3

In [142]:
data_T.values

array([['김유진', 25, 1, 'A', True, 3],
       ['김정민', 31, 0, 'B', False, 4],
       ['홍길동', 36, None, 'C', False, 1],
       ['박보람', 13, 1, 'D', True, 3]], dtype=object)

In [143]:
data_T.tail()

          Name Age Gender(M:0,W:1) Grade Survey Result
Customer1  김유진  25               1     A   True      3
Customer2  김정민  31               0     B  False      4
Customer3  홍길동  36            None     C  False      1
Customer4  박보람  13               1     D   True      3

In [144]:
data_T.shape

(4, 6)

In [145]:
data_T.size

24

In [146]:
data_T.dtypes

Name               object
Age                object
Gender(M:0,W:1)    object
Grade              object
Survey             object
Result             object
dtype: object

In [147]:
data_1

                Customer1 Customer2 Customer3 Customer4
Name                  김유진       김정민       홍길동       박보람
Age                    25        31        36        13
Gender(M:0,W:1)         1         0      None         1
Grade                   A         B         C         D
Survey               True     False     False      True
Result                  3         4         1         3

In [148]:
data_1.dtypes

Customer1    object
Customer2    object
Customer3    object
Customer4    object
dtype: object

In [149]:
data_1.info()

<class 'pandas.core.frame.DataFrame'>
Index: 6 entries, Name to Result
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Customer1  6 non-null      object
 1   Customer2  6 non-null      object
 2   Customer3  5 non-null      object
 3   Customer4  6 non-null      object
dtypes: object(4)
memory usage: 412.0+ bytes

In [150]:
data_T.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, Customer1 to Customer4
Data columns (total 6 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Name             4 non-null      object
 1   Age              4 non-null      object
 2   Gender(M:0,W:1)  3 non-null      object
 3   Grade            4 non-null      object
 4   Survey           4 non-null      object
 5   Result           4 non-null      object
dtypes: object(6)
memory usage: 396.0+ bytes

In [151]:
dd = pd.DataFrame(data = {'name':['홍길동', 'Jessica', '장그래', '제인', None, '최강타'],
                          'gender':[1, 2, None, 2, 1, 1],
                          'job':['학생', None, '직장인', '주부', '직장인', '직장인'],
                          'age':[19, 55, 23, 35, None, None],
                          'grade':['A', 'C', 'B', None, None, 'A'],
                          'total':[None, 18.5, 23.7, 47.2, 13.5, 27.0],
                          'survey':[3, 4, 2, 5, 5, 3],
                          'result':[True, True, False, True, None, False]})

In [152]:
dd.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 8 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    5 non-null      object
 1   gender  5 non-null      float64
 2   job     5 non-null      object
 3   age     4 non-null      float64
 4   grade   4 non-null      object
 5   total   5 non-null      float64
 6   survey  6 non-null      int64
 7   result  5 non-null      object
dtypes: float64(3), int64(1), object(4)
memory usage: 512.0+ bytes

In [153]:
dd

      name  gender   job   age grade  total  survey result
0      홍길동     1.0    학생  19.0     A    NaN       3   True
1  Jessica     2.0  None  55.0     C   18.5       4   True
2      장그래     NaN   직장인  23.0     B   23.7       2  False
3       제인     2.0    주부  35.0  None   47.2       5   True
4     None     1.0   직장인   NaN  None   13.5       5   None
5      최강타     1.0   직장인   NaN     A   27.0       3  False

In [154]:
dd.loc[3]

name        제인
gender     2.0
job         주부
age       35.0
grade     None
total     47.2
survey       5
result    True
Name: 3, dtype: object

In [155]:
c1 = ['홍길동', 1, '학생', 19, 'A', None, 3, True]
c2 = ['Jessica', 2, None, 55, 'C', 18.5, 4, True]
c3 = ['장그래', None, '직장인', 23, 'B', 23.7, 2, False]
c4 = ['제인', 2, '주부', 35, None, 47.2, 5, True]
c5 = [None, 1, '직장인',  None, None, 13.5, 5, None]
c6 = ['최강타', 1, '직장인', None, 'A', 27.0, 3, False]

cs = pd.DataFrame(data = [c1, c2, c3, c4, c5, c6],
                  index = ['고객1', '고객2', '고객3', '고객4', '고객5', '고객6'],
                  columns = ['name', 'gender', 'job', 'age', 'grade', 'total', 'survey', 'result'])

In [156]:
cs

        name  gender   job   age grade  total  survey result
고객1      홍길동     1.0    학생  19.0     A    NaN       3   True
고객2  Jessica     2.0  None  55.0     C   18.5       4   True
고객3      장그래     NaN   직장인  23.0     B   23.7       2  False
고객4       제인     2.0    주부  35.0  None   47.2       5   True
고객5     None     1.0   직장인   NaN  None   13.5       5   None
고객6      최강타     1.0   직장인   NaN     A   27.0       3  False

In [157]:
cs.loc['고객2']

name      Jessica
gender        2.0
job          None
age          55.0
grade           C
total        18.5
survey          4
result       True
Name: 고객2, dtype: object

In [158]:
cs.loc['고객5']

name      None
gender     1.0
job        직장인
age        NaN
grade     None
total     13.5
survey       5
result    None
Name: 고객5, dtype: object

In [159]:
cs.loc[['고객1']]

    name  gender job   age grade  total  survey result
고객1  홍길동     1.0  학생  19.0     A    NaN       3   True

In [160]:
cs.iloc[[0]]

    name  gender job   age grade  total  survey result
고객1  홍길동     1.0  학생  19.0     A    NaN       3   True

In [161]:
cs.iloc[1:3]

        name  gender   job   age grade  total  survey result
고객2  Jessica     2.0  None  55.0     C   18.5       4   True
고객3      장그래     NaN   직장인  23.0     B   23.7       2  False

In [162]:
cs.iloc[1:1]

Empty DataFrame
Columns: [name, gender, job, age, grade, total, survey, result]
Index: []

In [163]:
cs['고객3':'고객3']

    name  gender  job   age grade  total  survey result
고객3  장그래     NaN  직장인  23.0     B   23.7       2  False

In [164]:
cs.loc['고객1':'고객4']

        name  gender   job   age grade  total  survey result
고객1      홍길동     1.0    학생  19.0     A    NaN       3   True
고객2  Jessica     2.0  None  55.0     C   18.5       4   True
고객3      장그래     NaN   직장인  23.0     B   23.7       2  False
고객4       제인     2.0    주부  35.0  None   47.2       5   True

In [165]:
cs.loc['고객1']

name       홍길동
gender     1.0
job         학생
age       19.0
grade        A
total      NaN
survey       3
result    True
Name: 고객1, dtype: object

In [166]:
cs.loc[['고객1','고객3','고객5']]

     name  gender  job   age grade  total  survey result
고객1   홍길동     1.0   학생  19.0     A    NaN       3   True
고객3   장그래     NaN  직장인  23.0     B   23.7       2  False
고객5  None     1.0  직장인   NaN  None   13.5       5   None

In [167]:
cs.iloc[0,3]

19.0

In [176]:
cs.iloc[[0,4,2]]

     name  gender  job   age grade  total  survey result
고객1   홍길동     1.0   학생  19.0     A    NaN       3   True
고객5  None     1.0  직장인   NaN  None   13.5       5   None
고객3   장그래     NaN  직장인  23.0     B   23.7       2  False

In [188]:
cs_sort = cs.iloc[[0,4,2]]

In [190]:
cs_sort.sort_values(by=['survey'], ascending = True)

     name  gender  job   age grade  total  survey result
고객3   장그래     NaN  직장인  23.0     B   23.7       2  False
고객1   홍길동     1.0   학생  19.0     A    NaN       3   True
고객5  None     1.0  직장인   NaN  None   13.5       5   None

In [192]:
cs_sort.sort_index()

     name  gender  job   age grade  total  survey result
고객1   홍길동     1.0   학생  19.0     A    NaN       3   True
고객3   장그래     NaN  직장인  23.0     B   23.7       2  False
고객5  None     1.0  직장인   NaN  None   13.5       5   None

In [193]:
cs.grade

고객1       A
고객2       C
고객3       B
고객4    None
고객5    None
고객6       A
Name: grade, dtype: object

In [205]:
dd.loc[:,['job']]

    job
0    학생
1  None
2   직장인
3    주부
4   직장인
5   직장인

In [214]:
cs.loc['고객1':'고객3','age':'result'] #특정 범위 행, 열 추출

      age grade  total  survey result
고객1  19.0     A    NaN       3   True
고객2  55.0     C   18.5       4   True
고객3  23.0     B   23.7       2  False

In [217]:
dd.loc[0:4,['name','age']] #특정 값의 행, 열 추출

      name   age
0      홍길동  19.0
1  Jessica  55.0
2      장그래  23.0
3       제인  35.0
4     None   NaN